{
  "Metadata": {
    "title": "Wilson Bravo - Desarrollador Web Fullstack | Portafolio y Proyectos",
    "description": "Portafolio profesional de Wilson Bravo, desarrollador web fullstack. Descubre mi experiencia, proyectos destacados, una demo funcional de backend y una pequeña biografía. Soluciones modernas y personalizadas para la web."
  },
  "HomePage": {
    "title": "¡Hola mundo!",
    "about": {
      "title": "Sobre Mi",
      "sections": {
        "born-city": {
          "title": "Nacido en Pasto",
          "description": "SEPT 2000 - JUL 2018",
          "paragraph": "Nací en Pasto, Nariño, y mi trayectoria académica y profesional ha estado marcada por una sólida formación en ingeniería electrónica. Inicialmente, adquirí conocimientos en instalaciones eléctricas y electrónica básica durante mi educación en una institución técnica."
        },
        "university": {
          "title": "Universidad",
          "description": "JUL 2018 - MAR 2024",
          "paragraph": "Posteriormente, decidí ampliar mis horizontes académicos y me gradué como Ingeniero Electrónico de la Pontificia Universidad Javeriana.\n\nDurante mi tiempo en la universidad, profundicé en fundamentos de ingeniería, física aplicada y programación de microcontroladores."
        },
        "programming": {
          "title": "Programación",
          "description": "JUL 2018 - MAR 2024",
          "paragraph": "Además, me especialicé en áreas como inteligencia artificial, Internet de las Cosas (IoT), y procesamiento y visión de imágenes, consolidando así mi interés por el desarrollo tecnológico.\n\nMi dedicación fue reconocida con una mención de honor por mi trabajo de grado."
        },
        "wom": {
          "title": "Pasantía",
          "description": "AGO 2023 - ENE 2024",
          "paragraph": "Apliqué mis conocimientos en un entorno práctico. Mis pasantías profesionales en WOM (Partners Telecom Colombia) fueron una oportunidad invaluable para poner en práctica mis habilidades. En diversos proyectos, desde el desarrollo de un gestor de procesos con Tkinter hasta la implementación de aplicaciones web con Django y la creación de APIs para consultas automáticas a bases de datos Oracle, demostré mi dominio de la programación en Python.\n\nDurante esta experiencia, también adquirí conocimientos en el manejo de datos de herramientas clave como Zabbix, Grafana y AppDynamics, lo que se tradujo en soluciones efectivas."
        },
        "oracle": {
          "title": "Desarrollo Web",
          "description": "ENE 2024 - JUL 2024",
          "paragraph": "Como parte del programa Oracle Next Education (ONE), profundicé mis conocimientos en desarrollo web full-stack. Trabajé en la creación de aplicaciones web escalables utilizando tecnologías como HTML, CSS, JavaScript y frameworks modernos como React y Node.js. El programa enfatizó metodologías ágiles, trabajo en equipo y buenas prácticas de código, fortaleciendo mis habilidades tanto técnicas como colaborativas.\n\nTambién desarrollé varios proyectos para mi portafolio, demostrando mi capacidad para traducir necesidades de los usuarios en soluciones web funcionales y responsivas."
        },
        "google": {
          "title": "Ciberseguridad",
          "description": "JUL 2024 - MAY 2025",
          "paragraph": "El programa Google Cybersecurity Professional Certificate me brindó habilidades prácticas en seguridad de redes, gestión de riesgos y análisis de amenazas. Obtuve experiencia directa con herramientas como Wireshark, Linux y plataformas SIEM, lo que me permitió detectar vulnerabilidades y responder eficazmente a incidentes.\n\nEsta formación fortaleció mi comprensión de los marcos de seguridad y las mejores prácticas, preparándome para contribuir a entornos digitales seguros y robustos."
        }
      }
    },
    "hello": "¡Hola soy Wilson!",
    "self-description": "Soy Ingeniero Electrónico y Desarrollador Full Stack con experiencia en la gestión de datos y solución de problemas en la implementación de software. Me apasiona mejorar mis habilidades y aportar valor en cada proyecto.",
    "personal-skills": {
      "title": "Habilidades Personales",
      "skills": {
        "communication": "Comunicación",
        "creativity": "Creatividad",
        "teamwork": "Trabajo en Equipo",
        "flexibility": "Flexibilidad"
      }
    },
    "interests": {
      "title": "Intereses",
      "items": {
        "drawing": "Dibujo",
        "music": "Música",
        "webDevelopment": "Desarrollo Web",
        "cybersecurity": "Ciberseguridad",
        "ai": "Inteligencia Artificial",
        "iot": "Internet de las Cosas"
      }
    },
    "skills": {
      "title": "Habilidades"
    },
    "projects": {
      "title": "Proyectos",
      "swipe": "Desliza",
      "items": {
        "undergraduateThesis": {
          "imgUrl": "/projects/thesis.png",
          "title": "Proyecto de Grado",
          "description": "Aplicación web desarrollada con Django y scripts de python para la detección de violencia en tiempo real. Utiliza técnicas de procesamiento de imágenes y aprendizaje automático para identificar situaciones de riesgo, contribuyendo a la seguridad y bienestar social.",
          "doc": "https://apidspace.javeriana.edu.co/server/api/core/bitstreams/32f6b456-6931-41ef-b5a9-3c9b1109cdbd/content",
          "repo": "https://github.com/WilsonBravo/Violence_Detection_Public_Repo.git"
        },
        "portfolio": {
          "imgUrl": "/projects/WebPortfolio.png",
          "title": "Portafolio",
          "description": "Aplicación Web desarrollada con NextJS, Material UI y TypeScript. Muestra mis proyectos, habilidades y experiencia profesional, con un diseño moderno y responsivo."
        },
        "lifeSwap": {
          "imgUrl": "/projects/life_swap.png",
          "title": "Life Swap",
          "description": "Aplicación mobil para intercambio de rutinas diarias entre usuarios, desarrollada con NestJS y React Native. Permite a los usuarios compartir y adoptar rutinas de otros, fomentando un estilo de vida saludable y diverso."
        },
        "Admin Dashboard": {
          "imgUrl": "/projects/AdminDashboard.png",
          "title": "Admin Dashboard",
          "description": "Aplicación web de administración de datos, desarrollada con NextJS y TypeScript. Permite la gestión eficiente de información, con un enfoque en la usabilidad y la seguridad."
        }
      }
    }
  },
  "utils": {
    "paragraph": {
      "more": "ver más",
      "less": "ver menos"
    },
    "advices": {
      "close-window": "Presiona en cualquier lado para cerrar esta ventana."
    },
    "urls": {
      "github": "https://github.com/WilsonBravo",
      "linkedin": "https://www.linkedin.com/in/wilson-bravo",
      "email": "mailto:bravoc.wilson@gmail.com",
      "cv": "/documents/CV_Wilson_Bravo.pdf"
    }
  }
}
